# Add for keyboard and iterm2 alt key options

###############################################################################
# Works on Mac                                                               #
###############################################################################

tap "homebrew/bundle"
tap "homebrew/services"
# tap "now/devtools", "https://code.devsnc.com/dev/homebrew-now"
brew "ffmpeg"
brew "git"
brew "hey"
brew "httpd"
brew "imagemagick"
brew "jenv"
brew "jq"
# brew "mariadb@10.6", restart_service: true
# brew "nginx", restart_service: true

brew "nvm"
export NVM_DIR="$([ -z "${XDG_CONFIG_HOME-}" ] && printf %s "${HOME}/.nvm" || printf %s "${XDG_CONFIG_HOME}/nvm")"
[ -s "$NVM_DIR/nvm.sh" ] && \. "$NVM_DIR/nvm.sh" # This loads nvm

# brew "openjdk@11"
# brew "openjdk@17"
brew "pcre"
brew "pyenv"
brew "now/devtools/ant"
brew "now/devtools/maven36"
cask "rectangle"
cask "iterm2"
cask "postman"
#cask "mattermost"
cask "logi-options+"
cask "clipy"

cask "koekeishiya/formulae/skhd"
touch $HOME/.skhdrc

vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "arjun.swagger-viewer"
vscode "arnoudkooicom.sn-scriptsync"
vscode "ban.spellright"
vscode "burkeholland.simple-react-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eastman.vscode-cfn-nag"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.minify"
vscode "jasonnutter.search-node-modules"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kddejong.vscode-cfn-lint"
vscode "leizongmin.node-module-intellisense"
vscode "loczek.next-js-ts-snippets"
vscode "mike-co.import-sorter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "msjsdiag.vscode-react-native"
vscode "natqe.reload"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "orta.vscode-jest"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "runem.lit-plugin"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "sebastianbille.iam-legend"
vscode "servicenow.fluent-language-extension"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "tyriar.lorem-ipsum"
vscode "unional.vscode-sort-package-json"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zainsra.automate-react"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"

touch $HOME/.skhdrc
